src/artillery.yml
config:
  target: https://dev.oneid.pagopa.it/login?response_type=CODE&scope=openid&client_id=8U61NU_F8NMFDnTdW5zUt04MJ7wYRD_WgQbihbeenFg&state=dev&nonce=11701879fd734d1486b8a6435025b465&redirect_uri=https://442zl6z6sbdqprefkazmp6dr3y0nmnby.lambda-url.eu-south-1.on.aws/client/cb
  phases:
     - arrivalRate: 1
       rampTo: 3
    #- arrivalCount: 1
       duration: 60
        # Load the Playwright engine:
  engines:
    playwright:
      launchOptions:
        headless: true
  # Path to JavaScript file that defines Playwright test functions
  processor: './artillery.js'
scenarios:
  - engine: playwright
    flowFunction: "oi"